Repository: Vagabond-K/VagaModbus
Catalog: VagaModbusAnalyzer.UWP/Strings/*/Resources.resw
Languages: ko_kr

# ModbusChannelsView_AddChannel.Content
source: Add channel
ko_kr: 채널 추가

# ModbusChannelsView_AppBarButton_AddChannel.Label
source: Add channel
ko_kr: 채널 추가

# ModbusChannelsView_ChannelSettingSerialPort_Handshake.Text
source: Handshake:
ko_kr: 흐름 제어:

# ModbusChannelsView_ChannelSettingSerialPort_Parity.Text
source: Parity:
ko_kr: 패리티:

# ModbusChannelsView_ChannelSettingSerialPort_Description.Text
source: Serial port:
ko_kr: 시리얼 포트:

# ModbusChannelsView_ChannelSettingTcpClient_ConnectTimeout.Text
source: Connect Timeout:
ko_kr: 연결 제한 시간:

# ModbusChannelsView_ChannelSettingTcpClient_Host.Text
source: Host name:
ko_kr: 호스트:

# ModbusChannelsView_ChannelSettingTcpClient_Port.Text
source: TCP port:
ko_kr: TCP 포트:

# ModbusChannelsView_ChannelSettingTcpServer_Port.Text
source: TCP server listening port:
ko_kr: TCP 서버 수신 포트:

# ModbusChannelsView_ChannelSettingTcpServer_Description.Text
source: This channel operates by listening for connections through a TCP socket.
ko_kr: 본 채널은 TCP 소켓으로 연결을 수신하여 동작합니다.

# ModbusChannelsView_ChannelSettingUdpSocket_RemotePort.Text
source: Remote UDP port:
ko_kr: 원격 UDP 포트:

# ModbusChannelsView_ChannelSettingUdpSocket_Host.Text
source: Host name:
ko_kr: 호스트:

# ModbusChannelsView_ChannelSettingUdpSocket_LocalPort.Text
source: Local UDP port:
ko_kr: 로컬 UDP 포트:

# ModbusChannelsView_ChannelSetting_ModbusType.Text
source: Protocol version:
ko_kr: 프로토콜 버전:

# EditModbusChannelView_AddChannel.Title
source: Add channel
ko_kr: 채널 추가

# EditModbusChannelView_AppBarButton_Save.Label
source: Save
ko_kr: 저장

# EditModbusChannelView_EditChannel.Title
source: Edit channel
ko_kr: 채널 편집

# EditModbusScanView.PrimaryButtonText
source: OK
ko_kr: 확인

# EditModbusScanView.SecondaryButtonText
source: Cancel
ko_kr: 취소

# ItemDeleteButton.Text
source: Delete
ko_kr: 삭제

# ItemEditButton.Text
source: Edit
ko_kr: 편집

# MasterDetailMenuButton_ModbusChannels.Content
source: Channels
ko_kr: 채널 관리

# MasterDetailMenuButton_Logs.Content
source: Comm. Logs
ko_kr: 통신 로그 조회

# MasterDetailMenuButton_ReadData.Content
source: Read Data
ko_kr: 데이터 읽기

# MasterDetailMenuButton_Settings.Content
source: Settings
ko_kr: 설정

# NewChannelName
source: New channel
ko_kr: 새 채널

# NotSupportedAccentColorText.Text
source: This color is not supported.
ko_kr: 이 색은 지원되지 않습니다.

# ReadDataView_AddScan.Content
source: Add scan
ko_kr: 스캔 추가

# ReadDataView_AppBarButton_AddScan.Label
source: Add scan
ko_kr: 스캔 추가

# Settings_About.Header
source: About
ko_kr: 정보

# Settings_About_ModbusOrg.Content
source: The Modbus Organization
ko_kr: Modbus Organization 사이트

# Settings_About_ModbusWiki.Content
source: Modbus Protocol (Wikipedia)
ko_kr: Modbus 프로토콜 (Wikipedia)

# Settings_General.Header
source: General
ko_kr: 일반

# Settings_General_ThemeSelect.Text
source: Choose a mode
ko_kr: 모드 선택

# Settings_General_ThemeSelect_CustomAccent.Text
source: Custom accent color
ko_kr: 사용자 지정 색

# Settings_General_ThemeSelect_Dark.Content
source: Dark
ko_kr: 어둡게

# Settings_General_ThemeSelect_Default.Content
source: Windows default
ko_kr: Windows 기본값

# Settings_General_ThemeSelect_DefaultAccent.Text
source: Windows default accent color
ko_kr: Windows 기본 테마 컬러 사용

# Settings_General_ThemeSelect_Light.Content
source: Light
ko_kr: 밝게

# Settings_General_ThemeSelect_Windows.Content
source: Windows color settings
ko_kr: Windows 색 설정

# Text_DataAddress.Text
source: Data address
ko_kr: 데이터 어드레스

# Text_DataType.Text
source: Data type
ko_kr: 데이터 형식

# Text_NumOfData.Text
source: Number of data
ko_kr: 데이터 개수

# Text_SlaveAddress.Text
source: Slave address
ko_kr: 슬레이브 어드레스

# ThemeColorPickerPopupView.PrimaryButtonText
source: OK
ko_kr: 확인

# ThemeColorPickerPopupView.SecondaryButtonText
source: Cancel
ko_kr: 취소

# ThemeColorPickerPopupView.Title
source: Choose custom accent color
ko_kr: 사용자 지정 색 선택

# EditModbusScanView_AddScan.Title
source: Add scan
ko_kr: 스캔 추가

# EditModbusScanView_EditScan.Title
source: Edit scan
ko_kr: 스캔 편집

# Text_ResponseTimeout.Text
source: Response timeout
ko_kr: 응답 제한 시간

# EditModbusChannelView_ChannelName.Header
source: Channel name
ko_kr: 채널 이름

# EditModbusChannelView_ChannelType.Text
source: Channel type
ko_kr: 채널 타입

# EditModbusChannelView_ChannelType_SerialPort.Content
source: Serial port
ko_kr: 시리얼 포트

# EditModbusChannelView_ChannelType_TcpClient.Content
source: TCP Client
ko_kr: TCP 클라이언트

# EditModbusChannelView_ChannelType_TcpServer.Content
source: TCP Server
ko_kr: TCP 서버

# EditModbusChannelView_ChannelType_UdpSocket.Content
source: UDP Socket
ko_kr: UDP 소켓

# EditModbusChannelView_ProtocolVersion.Text
source: Protocol version
ko_kr: 프로토콜 버전

# EditModbusChannelView_ScanInterval.Text
source: Scan interval
ko_kr: 스캔 간격

# EditModbusChannelView_SerialPort_BaudRate.Header
source: Baud rate
ko_kr: 통신 속도

# EditModbusChannelView_SerialPort_DataBits.Header
source: Data bits
ko_kr: 데이터 비트

# EditModbusChannelView_SerialPort_Handshake.Header
source: Handshake
ko_kr: 흐름 제어

# EditModbusChannelView_SerialPort_Parity.Header
source: Parity
ko_kr: 패리티

# EditModbusChannelView_SerialPort_PortName.Header
source: Serial port name
ko_kr: 시리얼 포트 명

# EditModbusChannelView_SerialPort_StopBits.Header
source: Stop bits
ko_kr: 정지 비트

# EditModbusChannelView_TcpClient_ConnectTimeout.Text
source: Connection timeout
ko_kr: 연결 제한 시간

# EditModbusChannelView_TcpClient_HostName.Header
source: Host name
ko_kr: 호스트 명

# EditModbusChannelView_TcpClient_Port.Header
source: Port
ko_kr: 포트

# EditModbusChannelView_TcpServer_Port.Header
source: Port
ko_kr: 포트

# EditModbusChannelView_UdpSocket_HostName.Header
source: Host name
ko_kr: 호스트 명

# EditModbusChannelView_UdpSocket_RemotePort.Header
source: Remote port
ko_kr: 원격 포트

# EditModbusChannelView_UdpSocket_LocalPort.Header
source: Local port
ko_kr: 로컬 포트

# Text_CommNormal.Text
source: Communication is in progress normally.
ko_kr: 정상 통신 진행 중

# Text_LastUpdated.Text
source: Last Updated
ko_kr: 마지막 업데이트

# Text_ScanOff.Text
source: N/A (Scan is not turned on.)
ko_kr: N/A (스캔이 시작되지 않았습니다.)

# Text_Status.Text
source: Status
ko_kr: 상태

# Text_Hexadecimal.Text
source: Hexadecimal
ko_kr: 16진수

# Text_LogicalValue.Text
source: Logical Value
ko_kr: 논리 값

# Text_DoubleValue.Text
source: Double precision
ko_kr: 배정밀도 소수

# Text_FloatValue.Text
source: Single precision
ko_kr: 단정밀도 소수

# Text_DataAddresses.Text
source: Data addresses
ko_kr: 데이터 어드레스

# Text_SignedInteger.Text
source: Signed integer
ko_kr: 부호 있는 정수

# Text_UnsignedInteger.Text
source: Unsigned integer
ko_kr: 부호 없는 정수

# Text_Binary.Text
source: Binary
ko_kr: 이진법

# Text_Big_endian.Text
source: Big-endian
ko_kr: 빅 엔디언

# Text_Little_endian.Text
source: Little-endian
ko_kr: 리틀 엔디언

# Text_Bytes.Text
source: bytes
ko_kr: 바이트

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ErrorCRC
source: CRC error
ko_kr: CRC 오류

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ErrorLRC
source: LRC error
ko_kr: LRC 오류

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ModbusTcpSymbolError
source: Modbus TCP protocol ID is non-zero.
ko_kr: Modbus TCP 프로토콜 아이디가 0이 아님.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.NotDefinedModbusSerializer
source: Modbus serialization format not defined.
ko_kr: Modbus 직렬화 형식이 정의되지 않았음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseAddressDoNotMatch
source: Address of request and response do not match.
ko_kr: 요청과 응답의 Address가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseAsciiEndError
source: The terminating characters (CR LF) in Modbus ASCII could not be found.
ko_kr: Modbus ASCII의 종결 문자(CR LF)를 찾을 수 없음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseAsciiStartError
source: The starting character (:) for Modbus ASCII could not be found.
ko_kr: Modbus ASCII의 시작 문자(:)를 찾을 수 없음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseFunctionDoNotMatch
source: Function code of request and response do not match.
ko_kr: 요청과 응답의 Function 코드가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseLengthDoNotMatch
source: Data length in request and response do not match.
ko_kr: 요청과 응답의 데이터 길이가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseSlaveAddressDoNotMatch
source: Slave address of request and response do not match.
ko_kr: 요청과 응답의 Slave Address가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseTcpLengthDoNotMatch
source: The length indicated in the Modbus TCP header does not match the length of the Modbus message.
ko_kr: Modbus TCP 헤더에 표시된 길이와 Modbus 메시지의 길이가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseTimeout
source: Response timeout
ko_kr: 응답 타임아웃

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseWritedLengthDoNotMatch
source: Multiple write length in request and response do not match.
ko_kr: 요청과 응답의 다중 쓰기 길이가 일치하지 않음.

# VagabondK.Protocols.Modbus.ModbusCommErrorCode.ResponseWritedValueDoNotMatch
source: The write value ​​in the request and response do not match.
ko_kr: 요청과 응답의 쓰기 값이 일치하지 않음.

# Text_UnrecognizedError.Text
source: Received an unrecognized message
ko_kr: 인식할 수 없는 메시지를 수신함

# Text_ChannelCloseMessage.Text
source: Communication channel has been closed.
ko_kr: 통신 채널이 닫혔습니다.

# Text_ChannelOpenMessage.Text
source: Communication channel has been opened.
ko_kr: 통신 채널이 열렸습니다.

# ModbusExceptionDetails.Acknowledge
source: Slave device has accepted request and is processing it, but a long duration of time is required. This response is returned to prevent a timeout error from occurring in the master. client can next issue a Poll Program Complete message to determine whether processing is completed.
ko_kr: 슬레이브 디바이스가 요청을 수락하고 처리 중이지만 오랜 시간이 필요합니다. 마스터에서 시간 초과 오류가 발생하지 않도록 이 응답이 반환됩니다. 클라이언트는 다음으로 Poll Program Complete 메시지를 발행하여 처리가 완료되었는지 여부를 결정할 수 있습니다.

# ModbusExceptionDetails.GatewayPathUnavailable
source: Specialized for Modbus gateways. Indicates a misconfigured gateway.
ko_kr: Modbus 게이트웨이인 경우, 잘못 구성된 게이트웨이일 수 있습니다.

# ModbusExceptionDetails.GatewayTargetDeviceFailedToRespond
source: Specialized for Modbus gateways. Sent when slave device fails to respond.
ko_kr: Modbus 게이트웨이인 경우, 슬레이브 디바이스가 응답하지 않는 상황입니다.

# ModbusExceptionDetails.IllegalDataAddress
source: Data address of some or all the required entities are not allowed or do not exist in slave device.
ko_kr: 일부 또는 모든 필수 엔터티의 데이터 주소가 허용되지 않거나 슬레이브 디바이스에 존재하지 않습니다.

# ModbusExceptionDetails.IllegalDataValue
source: Value is not accepted by slave device.
ko_kr: 슬레이브 디바이스에서 허용되지 않는 값입니다.

# ModbusExceptionDetails.IllegalFunction
source: Function code received in the query is not recognized or allowed by slave device.
ko_kr: 요청한 Function 코드는 슬레이브 디바이스에서 인식할 수 없거나 허용하지 않습니다.

# ModbusExceptionDetails.MemoryParityError
source: Slave device detected a parity error in memory. Master can retry the request, but service may be required on the slave device.
ko_kr: 슬레이브 디바이스가 메모리에서 패리티 오류를 감지했습니다. 마스터에서 요청을 다시 시도할 수 있지만 슬레이브 디바이스에서 처리가 필요할 수 있습니다.

# ModbusExceptionDetails.NegativeAcknowledge
source: Slave device cannot perform the programming functions. Master should request diagnostic or error information from slave device.
ko_kr: 슬레이브 디바이스는 프로그래밍 기능을 수행할 수 없습니다. 마스터는 슬레이브 디바이스에 진단 또는 오류 정보를 요청해야 합니다.

# ModbusExceptionDetails.NotDefined
source: None
ko_kr: 없음

# ModbusExceptionDetails.SlaveDeviceBusy
source: Slave device is engaged in processing a long-duration command. Master should retry later.
ko_kr: 슬레이브 디바이스가 장기 명령을 처리하고 있습니다. 마스터는 나중에 다시 시도해야 합니다.

# ModbusExceptionDetails.SlaveDeviceFailure
source: Unrecoverable error occurred while slave device was attempting to perform requested action.
ko_kr: 슬레이브 디바이스가 요청된 작업을 수행하는 동안 복구할 수 없는 오류가 발생했습니다.

# Text_Channel.Text
source: Channel
ko_kr: 채널

# Text_Code.Text
source: Code
ko_kr: 코드

# Text_RawData.Text
source: Raw data
ko_kr: 원본 데이터

# Text_Description.Text
source: Description
ko_kr: 내용

# Text_Details.Text
source: Details
ko_kr: 상세 설명

# Text_ReceivedException.Text
source: An error message has been received.
ko_kr: 오류 발생 메시지를 수신했습니다.

# Text_Text.Text
source: Text
ko_kr: 텍스트

# Text_TimeStamp.Text
source: Time stamp
ko_kr: 일시

# Text_FunctionCode.Text
source: Function code
ko_kr: Function 코드

# Text_Request.Text
source: Request
ko_kr: 요청

# Text_Response.Text
source: Response
ko_kr: 응답

# Settings_About_ReferenceSites.Text
source: Reference sites
ko_kr: 참조 사이트

# LogsView_AppBarButton_AutoScroll.Label
source: Auto Scroll
ko_kr: 자동 스크롤

# LogsView_AppBarButton_Clear.Label
source: Clear
ko_kr: 모두 지우기

# MasterDetailMenuButton_WriteData.Content
source: Write Data
ko_kr: 데이터 쓰기

# WriteDataView_AddCoilWriter.Content
source: Add write to coil
ko_kr: Coil 쓰기 추가

# WriteDataView_AddHoldingRegisterWriter.Content
source: Add write to HR
ko_kr: HR 쓰기 추가

# WriteDataView_AppBarButton_AddCoilWriter.Label
source: Add write to coil
ko_kr: Coil 쓰기 추가

# WriteDataView_AppBarButton_AddHoldingRegisterWriter.Label
source: Add write to holding register
ko_kr: Holding Register 쓰기 추가

# EditModbusCoilWriterView_AddWriter/Title
source: Add write to coil
ko_kr: Coil 쓰기 추가

# EditModbusCoilWriterView_EditWriter/Title
source: Edit write to coil
ko_kr: Coil 쓰기 편집

# Text_CopyToClipboard.Text
source: Copy to clipboard
ko_kr: 클립보드에 복사

# Text_Hex.Text
source: Hex
ko_kr: 16진수

# Text_Message.Text
source: Message
ko_kr: 메시지

# Text_Send.Text
source: Send
ko_kr: 보내기

# Text_UseMultiWrite.Text
source: Use multiple write function
ko_kr: 다중 쓰기 Function 사용

# EditModbusHoldingRegisterWriterView_AppBarButton_AddValue.Label
source: Add value
ko_kr: 값 추가

# EditModbusHoldingRegisterWriterView_AppBarButton_Save.Label
source: Save
ko_kr: 저장

# Text_Address.Text
source: Address
ko_kr: 어드레스

# Text_BitFlags.Text
source: Bit flags
ko_kr: 비트 플래그 조합

# Text_Endian.Text
source: Endian
ko_kr: 엔디언

# Text_Mixed_endian.Text
source: Mixed-endian
ko_kr: 혼합 엔디언

# Text_ValueType.Text
source: Value type
ko_kr: 값 형식

# Text_Integer.Text
source: Integer
ko_kr: 정수
